_articles/2013-04-09-Learning-ARM.org
#+TITLE:Learning ARM
#+AUTHOR:ICECREAM(氷菓)
#+EMAIL:creamidea(AT)gmail.com
#+DESCRIPTION:ICECREAM(氷菓)
#+KEYWORDS:arm
#+OPTIONS:H:4 num:t toc:t \n:nil @:t ::t |:t ^:t f:t TeX:t email:t
#+LINK_HOME: https://creamidea.github.io
#+STYLE:<link rel="stylesheet" type="text/css" href="../css/style.css">
#+INFOJS_OPT: view: showall toc: nil

#+BEGIN_HTML
---
layout: doc
title: Learning ARM
subtitle: 学习arm的笔记 
categories: note
tags: arm
---
#+END_HTML

* 前言
这个学期中间的企业实训是学习ARM。感觉这个学期学习了很多的嵌入式啊。

那么我们就开始记录学习ARM的过程吧。

* 2013-04-09 火曜日<2013-04-09 Tue>
数据稍候处理：

0xFFEE1122

area:数据段的申明
code: 代码段。
还有数据段data, 常量段
READONLY: 段的说明 只读

entry: 相当于C函数main，段的入口
code32: 下面的程序使用32位

start: 标号，相当于goto后面的标号

end：表示代码段的结束

ADS
伪指令：area，entry， code32，start， end

MOV R0, PC ;将PC的值移入R0   

11010011管理程序 
三级指令流水线
。。。


arm指令

*不能出现Mov*

arm处理器寻址
arm指令集
arm汇编程序设计

LSL 


逻辑移位溢出位丢弃

算术移位溢出位填充

带链接的分支指令BL -> 子函数的调用

标号，数组用=

BNE

* 2013-04-14 日曜日<2013-04-14 Sun>
  今天是周日，现在终于有时间。现在稍微写一些东西。
  
  本来有好几个实验的，但是只记得两个了。

** 1. 汇编控制LED
     这个是需要参考文档手册来写的。
     MCU具体型号我忘记了。貌似是ARMXX。 S3C2440 TQ2440
     反正需要看手册查到LED对应的管脚，然后置相应的电平。
     然后过程中貌似让WatchDog休眠了，就是没有让其工作。代码中有说明。
     #+BEGIN_HTML
     <script src="https://gist.github.com/creamidea/fddb89ea273e7166d001.js"></script>
     #+END_HTML

** 2. The Linux Kernel Module Programming : Hello World
     模块源代码：
     #+BEGIN_HTML
     <script src="https://gist.github.com/creamidea/5381888.js"></script>
     #+END_HTML
     
     Makefile文件：
     #+BEGIN_HTML
     <script src="https://gist.github.com/creamidea/5381898.js"></script>
     #+END_HTML

     执行过程，及其运行结果：
     #+BEGIN_SRC sh
       $ make
       make -C /usr/src/linux-headers-3.5.0-23-generic M=/home/icecream/Desktop/hello-module modules
       make[1]: Entering directory `/usr/src/linux-headers-3.5.0-23-generic'
         Building modules, stage 2.
         MODPOST 1 modules
       make[1]: Leaving directory `/usr/src/linux-headers-3.5.0-23-generic'
       
       $ sudo insmod ./hello.ko
       
       $ dmesg | tail -n 3
       [21284.503186] sd 6:0:0:0: [sdb] Assuming drive cache: write through
       [21284.503192] sd 6:0:0:0: [sdb] Attached SCSI removable disk
       [22175.061237] Hello, icecream!
       
       $ sudo rmmod ./hello.ko
       
       $ dmesg | tail -n 3
       [21284.503192] sd 6:0:0:0: [sdb] Attached SCSI removable disk
       [22175.061237] Hello, icecream!
       [22362.563031] Exit the driver module!
       
       $ modinfo ./hello.ko
       filename:       ./hello.ko
       description:    A sample driver
       author:         icecream <creamidea@gmail.com>
       license:        Dual BSD/GPL
       srcversion:     599D2E058D4F2272D19DE0C
       depends:        
       vermagic:       3.5.0-23-generic SMP mod_unload modversions 
     #+END_SRC
* 2013-04-15 月曜日<2013-04-15 Mon>
** 声明全局变量数组和函数
  1. 这个是声明全局（外部可以使用，修改的）变量，
     数组和函数的实例程序代码。 linux内核模块编程。
     代码中有详细注释.
     #+BEGIN_HTML
     <script src="https://gist.github.com/creamidea/5387156.js"></script>
     #+END_HTML
  2. 运行测试
     #+BEGIN_SRC sh
       $ make
       make -C /usr/src/linux-headers-3.5.0-23-generic M=/home/icecream/Desktop/drive/export modules
       make[1]: Entering directory `/usr/src/linux-headers-3.5.0-23-generic'
         CC [M]  /home/icecream/Desktop/drive/export/export.o
         Building modules, stage 2.
         MODPOST 1 modules
         CC      /home/icecream/Desktop/drive/export/export.mod.o
         LD [M]  /home/icecream/Desktop/drive/export/export.ko
       make[1]: Leaving directory `/usr/src/linux-headers-3.5.0-23-generic'
       
       $ sudo insmod export.ko
       
       $ dmesg | tail -12
       [ 1738.701615] a + b = 22
       [ 1738.701617] count = 0
       [ 1738.701618] name = Hello, icecream
       [ 1738.701619] Array[0]: 1
       [ 1738.701620] Array[1]: 9
       [ 1738.701621] Array[2]: 9
       [ 1738.701621] Array[3]: 1
       [ 1738.701622] Array[4]: 1
       [ 1738.701623] Array[5]: 0
       [ 1738.701623] Array[6]: 0
       [ 1738.701624] Array[7]: 4
       [ 1738.701625] my fun is invoked!
       
       $ sudo rmmod export.ko
       
       $ dmesg | tail -12
       [ 1738.701618] name = Hello, icecream
       [ 1738.701619] Array[0]: 1
       [ 1738.701620] Array[1]: 9
       [ 1738.701621] Array[2]: 9
       [ 1738.701621] Array[3]: 1
       [ 1738.701622] Array[4]: 1
       [ 1738.701623] Array[5]: 0
       [ 1738.701623] Array[6]: 0
       [ 1738.701624] Array[7]: 4
       [ 1738.701625] my fun is invoked!
       [ 1788.664571] The sum of the array is 25 # 求和在退出时执行
       [ 1788.664574] Exit the driver module!
       
       #外界修改的方法:
       
       $ sudo insmod export.ko count=100 name="qooni"
       
       $ sudo insmod export.ko array=1,2,3,4,5 #(注意不要越界)
     #+END_SRC
  3. A small order:
     #+BEGIN_SRC sh
       $ export PS1="icecream$"
       # The bash will be icecream$
     #+END_SRC
     From: http://www.thegeekstuff.com/2008/09/bash-shell-ps1-10-examples-to-make-your-linux-prompt-like-angelina-jolie/
* 2013-04-16 火曜日<2013-04-16 Tue>
** 跨模块的函数调用
   1. 首先另创建一个export1，这个就是我们将用来调用函数的模块。
      export1.c的代码：
      #+BEGIN_HTML
      <script src="https://gist.github.com/creamidea/5395322.js"></script>
      #+END_HTML
      
   2. 运行，插入模块
      #+BEGIN_SRC sh
       	# 首先挂载export(我昨天写的代码)
       	$ sudo insmod ./export.ko
       	
       	# 挂载export1
       	$ sudo insmod ./export1.ko 
       	
       	# 显示信息
       	$ dmesg | tail -4
       	[ 6798.157855] Array[6]: 0
       	[ 6798.157856] Array[7]: 4
       	[ 6798.157857] my fun is invoked!
       	[ 6815.811947] In export1: my fun is invoked!
       	
       	# 卸载时，先卸载export1,再卸载export
       	# 否则会报错：
       	# ERROR: Module export is in use by export1
       	$ sudo rmmod export1
       	$ sudo rmmod export
      #+END_SRC

