_posts/2013-04-09-Learning-ARM.html
---
layout: doc
title: Learning ARM
subtitle: 学习arm的笔记 
categories: note
tags: arm
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 前言</a></li>
<li><a href="#sec-2">2 2013-04-09 火曜日</a></li>
<li><a href="#sec-3">3 2013-04-14 日曜日</a>
<ul>
<li><a href="#sec-3-1">3.1 1. 汇编控制LED</a></li>
<li><a href="#sec-3-2">3.2 2. The Linux Kernel Module Programming : Hello World</a></li>
</ul>
</li>
<li><a href="#sec-4">4 2013-04-15 月曜日</a>
<ul>
<li><a href="#sec-4-1">4.1 声明全局变量数组和函数</a></li>
</ul>
</li>
<li><a href="#sec-5">5 2013-04-16 火曜日</a>
<ul>
<li><a href="#sec-5-1">5.1 跨模块的函数调用</a></li>
<li><a href="#sec-5-2">5.2 字符设备驱动程序</a></li>
</ul>
</li>
<li><a href="#sec-6">6 2013-04-18 木曜日</a>
<ul>
<li><a href="#sec-6-1">6.1 创建自己的设备，调用自己写的模块中的函数。</a></li>
<li><a href="#sec-6-2">6.2 编写LED，交叉编译</a></li>
<li><a href="#sec-6-3">6.3 总结到目前为止编写此类代码步骤：</a></li>
</ul>
</li>
<li><a href="#sec-7">7 2013-04-19 金曜日</a>
<ul>
<li><a href="#sec-7-1">7.1 代码的准备</a></li>
<li><a href="#sec-7-2">7.2 烧写环境的配置</a>
<ul>
<li><a href="#sec-7-2-1">7.2.1 交叉编译环境的搭建</a></li>
</ul>
</li>
<li><a href="#sec-7-3">7.3 编译：</a></li>
<li><a href="#sec-7-4">7.4 程序下载</a>
<ul>
<li><a href="#sec-7-4-1">7.4.1 下载</a></li>
<li><a href="#sec-7-4-2">7.4.2 ARM系统中设置</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-8">8 写在最后</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">前言</h2>
<div class="outline-text-2" id="text-1">

<p>这个学期中间的企业实训是学习ARM。感觉这个学期学习了很多的嵌入式啊。
</p>
<p>
那么我们就开始记录学习ARM的过程吧。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2013-04-09 火曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-09 Tue</span></span></h2>
<div class="outline-text-2" id="text-2">

<p>数据稍候处理：
</p>
<p>
0xFFEE1122
</p>
<p>
area:数据段的申明
code: 代码段。
还有数据段data, 常量段
READONLY: 段的说明 只读
</p>
<p>
entry: 相当于C函数main，段的入口
code32: 下面的程序使用32位
</p>
<p>
start: 标号，相当于goto后面的标号
</p>
<p>
end：表示代码段的结束
</p>
<p>
ADS
伪指令：area，entry， code32，start， end
</p>
<p>
MOV R0, PC ;将PC的值移入R0   
</p>
<p>
11010011管理程序 
三级指令流水线
。。。
</p>

<p>
arm指令
</p>
<p>
<b>不能出现Mov</b>
</p>
<p>
arm处理器寻址
arm指令集
arm汇编程序设计
</p>
<p>
LSL 
</p>

<p>
逻辑移位溢出位丢弃
</p>
<p>
算术移位溢出位填充
</p>
<p>
带链接的分支指令BL -&gt; 子函数的调用
</p>
<p>
标号，数组用=
</p>
<p>
BNE
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">2013-04-14 日曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-14 Sun</span></span></h2>
<div class="outline-text-2" id="text-3">

<p>  今天是周日，现在终于有时间。现在稍微写一些东西。
</p>
<p>  
  本来有好几个实验的，但是只记得两个了。
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">1. 汇编控制LED</h3>
<div class="outline-text-3" id="text-3-1">

<p>     这个是需要参考文档手册来写的。
     MCU具体型号我忘记了。貌似是ARMXX。 S3C2440 TQ2440
     反正需要看手册查到LED对应的管脚，然后置相应的电平。
     然后过程中貌似让WatchDog休眠了，就是没有让其工作。代码中有说明。
     <script src="https://gist.github.com/creamidea/fddb89ea273e7166d001.js"></script>

</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">2. The Linux Kernel Module Programming : Hello World</h3>
<div class="outline-text-3" id="text-3-2">

<p>     模块源代码：
     <script src="https://gist.github.com/creamidea/5381888.js"></script>
</p>
<p>     
     Makefile文件：
     <script src="https://gist.github.com/creamidea/5381898.js"></script>

     执行过程，及其运行结果：
</p>


<pre class="example">$ make
make -C /usr/src/linux-headers-3.5.0-23-generic M=/home/icecream/Desktop/hello-module modules
make[1]: Entering directory `/usr/src/linux-headers-3.5.0-23-generic'
  Building modules, stage 2.
  MODPOST 1 modules
make[1]: Leaving directory `/usr/src/linux-headers-3.5.0-23-generic'

$ sudo insmod ./hello.ko

$ dmesg | tail -n 3
[21284.503186] sd 6:0:0:0: [sdb] Assuming drive cache: write through
[21284.503192] sd 6:0:0:0: [sdb] Attached SCSI removable disk
[22175.061237] Hello, icecream!

$ sudo rmmod ./hello.ko

$ dmesg | tail -n 3
[21284.503192] sd 6:0:0:0: [sdb] Attached SCSI removable disk
[22175.061237] Hello, icecream!
[22362.563031] Exit the driver module!

$ modinfo ./hello.ko
filename:       ./hello.ko
description:    A sample driver
author:         icecream &lt;creamidea@gmail.com&gt;
license:        Dual BSD/GPL
srcversion:     599D2E058D4F2272D19DE0C
depends:        
vermagic:       3.5.0-23-generic SMP mod_unload modversions 
</pre>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">2013-04-15 月曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-15 Mon</span></span></h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">声明全局变量数组和函数</h3>
<div class="outline-text-3" id="text-4-1">

<ol>
<li>这个是声明全局（外部可以使用，修改的）变量，
     数组和函数的实例程序代码。 linux内核模块编程。
     代码中有详细注释.
     <script src="https://gist.github.com/creamidea/5387156.js"></script>
</li>
<li>运行测试



<pre class="example">$ make
make -C /usr/src/linux-headers-3.5.0-23-generic M=/home/icecream/Desktop/drive/export modules
make[1]: Entering directory `/usr/src/linux-headers-3.5.0-23-generic'
  CC [M]  /home/icecream/Desktop/drive/export/export.o
  Building modules, stage 2.
  MODPOST 1 modules
  CC      /home/icecream/Desktop/drive/export/export.mod.o
  LD [M]  /home/icecream/Desktop/drive/export/export.ko
make[1]: Leaving directory `/usr/src/linux-headers-3.5.0-23-generic'

$ sudo insmod export.ko

$ dmesg | tail -12
[ 1738.701615] a + b = 22
[ 1738.701617] count = 0
[ 1738.701618] name = Hello, icecream
[ 1738.701619] Array[0]: 1
[ 1738.701620] Array[1]: 9
[ 1738.701621] Array[2]: 9
[ 1738.701621] Array[3]: 1
[ 1738.701622] Array[4]: 1
[ 1738.701623] Array[5]: 0
[ 1738.701623] Array[6]: 0
[ 1738.701624] Array[7]: 4
[ 1738.701625] my fun is invoked!

$ sudo rmmod export.ko

$ dmesg | tail -12
[ 1738.701618] name = Hello, icecream
[ 1738.701619] Array[0]: 1
[ 1738.701620] Array[1]: 9
[ 1738.701621] Array[2]: 9
[ 1738.701621] Array[3]: 1
[ 1738.701622] Array[4]: 1
[ 1738.701623] Array[5]: 0
[ 1738.701623] Array[6]: 0
[ 1738.701624] Array[7]: 4
[ 1738.701625] my fun is invoked!
[ 1788.664571] The sum of the array is 25 # 求和在退出时执行
[ 1788.664574] Exit the driver module!

#外界修改的方法:

$ sudo insmod export.ko count=100 name="qooni"

$ sudo insmod export.ko array=1,2,3,4,5 #(注意不要越界)
</pre>

</li>
<li>A small order:



<pre class="example">$ export PS1="icecream$"
# The bash will be icecream$
</pre>

<p>
     From: <a href="http://www.thegeekstuff.com/2008/09/bash-shell-ps1-10-examples-to-make-your-linux-prompt-like-angelina-jolie/">http://www.thegeekstuff.com/2008/09/bash-shell-ps1-10-examples-to-make-your-linux-prompt-like-angelina-jolie/</a>
</p></li>
</ol>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">2013-04-16 火曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-16 Tue</span></span></h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">跨模块的函数调用</h3>
<div class="outline-text-3" id="text-5-1">

<ol>
<li>首先另创建一个export1，这个就是我们将用来调用函数的模块。
      export1.c的代码：
      <script src="https://gist.github.com/creamidea/5395322.js"></script>

</li>
<li>运行，插入模块



<pre class="example"># 首先挂载export(我昨天写的代码)
$ sudo insmod ./export.ko

# 挂载export1
$ sudo insmod ./export1.ko 

# 显示信息
$ dmesg | tail -4
[ 6798.157855] Array[6]: 0
[ 6798.157856] Array[7]: 4
[ 6798.157857] my fun is invoked!
[ 6815.811947] In export1: my fun is invoked!

# 卸载时，先卸载export1,再卸载export
# 否则会报错：
# ERROR: Module export is in use by export1
$ sudo rmmod export1
$ sudo rmmod export
</pre>

</li>
</ol>


</div>

</div>
