_articles/2013-04-09-Learning-ARM.org
** 字符设备驱动程序
   1. 实现步骤：
      1. 确定主设备号和次设备号

         dev\_t (long int) 32bit high:12->major low:20->minor

         <linux/types.h>

         MAJOR(dev\_t dev)

         MINOR(dev\_t dev)

         <linux/fs.h>

      2. 确定设备文件
      3. 创建设备文件
         1. 操作系统
         2. 人为
      4. 实现字符驱动程序

   2. 参考代码：
      #+BEGIN_HTML
      <script src="https://gist.github.com/creamidea/5395456.js"></script>
      #+END_HTML

   3. Character Device Drivers代码：
      #+BEGIN_SRC c
        /*
         ,*  chardev.c: Creates a read-only char device that says how many times
         ,*  you've read from the dev file
         ,*/
        
        #include <linux/kernel.h>
        #include <linux/module.h>
        #include <linux/fs.h>
        #include <asm/uaccess.h>/* for put_user */
        
        /*  
         ,*  Prototypes - this would normally go in a .h file
         ,*/
        int init_module(void);
        void cleanup_module(void);
        static int device_open(struct inode *, struct file *);
        static int device_release(struct inode *, struct file *);
        static ssize_t device_read(struct file *, char *, size_t, loff_t *);
        static ssize_t device_write(struct file *, const char *, size_t, loff_t *);
        
        #define SUCCESS 0
        #define DEVICE_NAME "chardev"/* Dev name as it appears in /proc/devices   */
        #define BUF_LEN 80/* Max length of the message from the device */
        
        /* 
         ,* Global variables are declared as static, so are global within the file. 
         ,*/
        
        static int Major;/* Major number assigned to our device driver */
        static int Device_Open = 0;/* Is device open?  
                                    ,* Used to prevent multiple access to device */
        static char msg[BUF_LEN];/* The msg the device will give when asked */
        static char *msg_Ptr;
        
        static struct file_operations fops = {
          .read = device_read,
          .write = device_write,
          .open = device_open,
          .release = device_release
        };
        
        /*
         ,* This function is called when the module is loaded
         ,*/
        int init_module(void)
        {
          Major = register_chrdev(0, DEVICE_NAME, &fops);
        
          if (Major < 0) {
            printk(KERN_ALERT "Registering char device failed with %d\n", Major);
            return Major;
          }
        
          printk(KERN_INFO "I was assigned major number %d. To talk to\n", Major);
          printk(KERN_INFO "the driver, create a dev file with\n");
          printk(KERN_INFO "'mknod /dev/%s c %d 0'.\n", DEVICE_NAME, Major);
          printk(KERN_INFO "Try various minor numbers. Try to cat and echo to\n");
          printk(KERN_INFO "the device file.\n");
          printk(KERN_INFO "Remove the device file and module when done.\n");
        
          return SUCCESS;
        }
        
        /*
         ,* This function is called when the module is unloaded
         ,*/
        void cleanup_module(void)
        {
          /* 
           ,* Unregister the device 
           ,*/
          int ret = unregister_chrdev(Major, DEVICE_NAME);
          if (ret < 0)
            printk(KERN_ALERT "Error in unregister_chrdev: %d\n", ret);
        }
        
        /*
         ,* Methods
         ,*/
        
        /* 
         ,* Called when a process tries to open the device file, like
         ,* "cat /dev/mycharfile"
         ,*/
        static int device_open(struct inode *inode, struct file *file)
        {
          static int counter = 0;
        
          if (Device_Open)
            return -EBUSY;
        
          Device_Open++;
          sprintf(msg, "I already told you %d times Hello world!\n", counter++);
          msg_Ptr = msg;
          try_module_get(THIS_MODULE);
        
          return SUCCESS;
        }
        
        /* 
         ,* Called when a process closes the device file.
         ,*/
        static int device_release(struct inode *inode, struct file *file)
        {
          Device_Open--;/* We're now ready for our next caller */
        
          /* 
           ,* Decrement the usage count, or else once you opened the file, you'll
           ,* never get get rid of the module. 
           ,*/
          module_put(THIS_MODULE);
        
          return 0;
        }
        
        /* 
         ,* Called when a process, which already opened the dev file, attempts to
         ,* read from it.
         ,*/
        static ssize_t device_read(struct file *filp,/* see include/linux/fs.h   */
                                   char *buffer,/* buffer to fill with data */
                                   size_t length,/* length of the buffer     */
                                   loff_t * offset)
        {
          /*
           ,* Number of bytes actually written to the buffer 
           ,*/
          int bytes_read = 0;
        
          /*
           ,* If we're at the end of the message, 
           ,* return 0 signifying end of file 
           ,*/
          if (*msg_Ptr == 0)
            return 0;
        
          /* 
           ,* Actually put the data into the buffer 
           ,*/
          while (length && *msg_Ptr) {
        
            /* 
             ,* The buffer is in the user data segment, not the kernel 
             ,* segment so "*" assignment won't work.  We have to use 
             ,* put_user which copies data from the kernel data segment to
             ,* the user data segment. 
             ,*/
            put_user(*(msg_Ptr++), buffer++);
        
            length--;
            bytes_read++;
          }
        
          /* 
           ,* Most read functions return the number of bytes put into the buffer
           ,*/
          return bytes_read;
        }
        
        /*  
         ,* Called when a process writes to dev file: echo "hi" > /dev/hello 
         ,*/
        static ssize_t
        device_write(struct file *filp, const char *buff, size_t len, loff_t * off)
        {
          printk(KERN_ALERT "Sorry, this operation isn't supported.\n");
          return -EINVAL;
        }
      #+END_SRC
      From: http://www.tldp.org/LDP/lkmpg/2.6/html/x569.html

   4. 代码稍微讲解：
      
      实现file\_operations结构体
      初始化函数，注册字符设备（挂载的过程中）
      销毁函数，取消设备（卸载的时候）
      
      struct cdev结构体及其操作<linux/cdev.h>：
      #+BEGIN_SRC c
        struct cdev {
          struct kobject kobj;
          struct module *owner;
          const struct file_operations *ops;
          struct list_head list;
          dev_t dev;
          unsigned int count;ruct cdev {
        };
        
        void cdev_init(struct cdev *, const struct file_operations *);
        
        int cdev_add(struct cdev *, dev_t, unsigned);
        
        void cdev_del(struct cdev *);
      #+END_SRC
      From: http://lxr.free-electrons.com/source/include/linux/cdev.h

      #+BEGIN_EXAMPLE
      kmalloc 小
      kmalloc(size_t, type)
      vmalloc 堆分配
      底层实现：
      页分配：get_free_pages()
      #+END_EXAMPLE      

      更加详细的一篇参考文章：
      http://www.linuxsir.org/bbs/thread193994.html

      其他资料：
      http://tuxthink.blogspot.com/2012/05/working-of-macros-majorminor-and-mkdev.html
* 2013-04-18 木曜日<2013-04-18 Thu>
