_posts/2013-04-09-Learning-ARM.html

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2">字符设备驱动程序</h3>
<div class="outline-text-3" id="text-5-2">

<ol>
<li>实现步骤：
<ol>
<li>确定主设备号和次设备号

<p>
         dev_t (long int) 32bit high:12-&gt;major low:20-&gt;minor
</p>
<p>
         &lt;linux/types.h&gt;
</p>
<p>
         MAJOR(dev_t dev)
</p>
<p>
         MINOR(dev_t dev)
</p>
<p>
         &lt;linux/fs.h&gt;
</p>
</li>
<li>确定设备文件
</li>
<li>创建设备文件
<ol>
<li>操作系统
</li>
<li>人为
</li>
</ol>

</li>
<li>实现字符驱动程序

</li>
</ol>

</li>
<li>参考代码：
      <script src="https://gist.github.com/creamidea/5395456.js"></script>

</li>
<li>Character Device Drivers代码：



<pre class="example">/*
 *  chardev.c: Creates a read-only char device that says how many times
 *  you've read from the dev file
 */

#include &lt;linux/kernel.h&gt;
#include &lt;linux/module.h&gt;
#include &lt;linux/fs.h&gt;
#include &lt;asm/uaccess.h&gt;/* for put_user */

/*  
 *  Prototypes - this would normally go in a .h file
 */
int init_module(void);
void cleanup_module(void);
static int device_open(struct inode *, struct file *);
static int device_release(struct inode *, struct file *);
static ssize_t device_read(struct file *, char *, size_t, loff_t *);
static ssize_t device_write(struct file *, const char *, size_t, loff_t *);

#define SUCCESS 0
#define DEVICE_NAME "chardev"/* Dev name as it appears in /proc/devices   */
#define BUF_LEN 80/* Max length of the message from the device */

/* 
 * Global variables are declared as static, so are global within the file. 
 */

static int Major;/* Major number assigned to our device driver */
static int Device_Open = 0;/* Is device open?  
                            * Used to prevent multiple access to device */
static char msg[BUF_LEN];/* The msg the device will give when asked */
static char *msg_Ptr;

static struct file_operations fops = {
  .read = device_read,
  .write = device_write,
  .open = device_open,
  .release = device_release
};

/*
 * This function is called when the module is loaded
 */
int init_module(void)
{
  Major = register_chrdev(0, DEVICE_NAME, &amp;fops);

  if (Major &lt; 0) {
    printk(KERN_ALERT "Registering char device failed with %d\n", Major);
    return Major;
  }

  printk(KERN_INFO "I was assigned major number %d. To talk to\n", Major);
  printk(KERN_INFO "the driver, create a dev file with\n");
  printk(KERN_INFO "'mknod /dev/%s c %d 0'.\n", DEVICE_NAME, Major);
  printk(KERN_INFO "Try various minor numbers. Try to cat and echo to\n");
  printk(KERN_INFO "the device file.\n");
  printk(KERN_INFO "Remove the device file and module when done.\n");

  return SUCCESS;
}

/*
 * This function is called when the module is unloaded
 */
void cleanup_module(void)
{
  /* 
   * Unregister the device 
   */
  int ret = unregister_chrdev(Major, DEVICE_NAME);
  if (ret &lt; 0)
    printk(KERN_ALERT "Error in unregister_chrdev: %d\n", ret);
}

/*
 * Methods
 */

/* 
 * Called when a process tries to open the device file, like
 * "cat /dev/mycharfile"
 */
static int device_open(struct inode *inode, struct file *file)
{
  static int counter = 0;

  if (Device_Open)
    return -EBUSY;

  Device_Open++;
  sprintf(msg, "I already told you %d times Hello world!\n", counter++);
  msg_Ptr = msg;
  try_module_get(THIS_MODULE);

  return SUCCESS;
}

/* 
 * Called when a process closes the device file.
 */
static int device_release(struct inode *inode, struct file *file)
{
  Device_Open--;/* We're now ready for our next caller */

  /* 
   * Decrement the usage count, or else once you opened the file, you'll
   * never get get rid of the module. 
   */
  module_put(THIS_MODULE);

  return 0;
}

/* 
 * Called when a process, which already opened the dev file, attempts to
 * read from it.
 */
static ssize_t device_read(struct file *filp,/* see include/linux/fs.h   */
                           char *buffer,/* buffer to fill with data */
                           size_t length,/* length of the buffer     */
                           loff_t * offset)
{
  /*
   * Number of bytes actually written to the buffer 
   */
  int bytes_read = 0;

  /*
   * If we're at the end of the message, 
   * return 0 signifying end of file 
   */
  if (*msg_Ptr == 0)
    return 0;

  /* 
   * Actually put the data into the buffer 
   */
  while (length &amp;&amp; *msg_Ptr) {

    /* 
     * The buffer is in the user data segment, not the kernel 
     * segment so "*" assignment won't work.  We have to use 
     * put_user which copies data from the kernel data segment to
     * the user data segment. 
     */
    put_user(*(msg_Ptr++), buffer++);

    length--;
    bytes_read++;
  }

  /* 
   * Most read functions return the number of bytes put into the buffer
   */
  return bytes_read;
}

/*  
 * Called when a process writes to dev file: echo "hi" &gt; /dev/hello 
 */
static ssize_t
device_write(struct file *filp, const char *buff, size_t len, loff_t * off)
{
  printk(KERN_ALERT "Sorry, this operation isn't supported.\n");
  return -EINVAL;
}
</pre>

<p>
      From: <a href="http://www.tldp.org/LDP/lkmpg/2.6/html/x569.html">http://www.tldp.org/LDP/lkmpg/2.6/html/x569.html</a>
</p>
</li>
<li>代码稍微讲解：

<p>      
      实现file_operations结构体
      初始化函数，注册字符设备（挂载的过程中）
      销毁函数，取消设备（卸载的时候）
</p>
<p>      
      struct cdev结构体及其操作&lt;linux/cdev.h&gt;：
</p>


<pre class="example">struct cdev {
  struct kobject kobj;
  struct module *owner;
  const struct file_operations *ops;
  struct list_head list;
  dev_t dev;
  unsigned int count;ruct cdev {
};

void cdev_init(struct cdev *, const struct file_operations *);

int cdev_add(struct cdev *, dev_t, unsigned);

void cdev_del(struct cdev *);
</pre>

<p>
      From: <a href="http://lxr.free-electrons.com/source/include/linux/cdev.h">http://lxr.free-electrons.com/source/include/linux/cdev.h</a>
</p>



<pre class="example">kmalloc 小
kmalloc(size_t, type)
vmalloc 堆分配
底层实现：
页分配：get_free_pages()
</pre>


<p>
      更加详细的一篇参考文章：
      <a href="http://www.linuxsir.org/bbs/thread193994.html">http://www.linuxsir.org/bbs/thread193994.html</a>
</p>
<p>
      其他资料：
      <a href="http://tuxthink.blogspot.com/2012/05/working-of-macros-majorminor-and-mkdev.html">http://tuxthink.blogspot.com/2012/05/working-of-macros-majorminor-and-mkdev.html</a>
</p></li>
</ol>

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">2013-04-18 木曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-18 Thu</span></span></h2>
<div class="outline-text-2" id="text-6">


</div>
