_articles/2013-04-09-Learning-ARM.org
** 创建自己的设备，调用自己写的模块中的函数。
   
   1. 模块代码：
      #+BEGIN_HTML
      <script src="https://gist.github.com/creamidea/5410271.js"></script>      
      #+END_HTML
      
   2. 测试代码：
      #+BEGIN_SRC c
        #include <stdio.h>
        #include <stdlib.h>
        #include <string.h>
        #include <unistd.h>
        #include <fcntl.h>
        #include <errno.h>
        
        int main(int argc, char *argv[])
        {
          if (argc < 2) {
            /* fprintf(STDOUT, "%s: %d",); */
            printf("Less 2");
            exit(0);
          }
        
          int fd;
          if ((fd = open(argv[1], O_RDONLY|O_NONBLOCK)) < 0) {
            printf ("Open error\n");
            exit(0);
          }
          sleep(1);
          close(fd);

          if ((fd = open(argv[1], O_WRONLY|O_NONBLOCK)) < 0) {
            printf ("Open error\n");
            exit(0);
          }
          sleep(1);
          close(fd);
        
          return 0;
        }
      #+END_SRC
      
   3. 运行和测试结果：
      #+BEGIN_SRC sh
        $ make
        $ sudo insmod ./openclose.ko
        $ sudo mknod /dev/chardev c 200 0
        $ sudo chmod 777 /dev/chardev 
        
        $ gcc test.c -Wall 
        $ ./a.out /dev/chardev 
        $ dmesg | tail -6
        [ 2165.567054] Open file Read Only
        [ 2165.567063] NON Block
        [ 2166.566718] Chr_close Close
        [ 2166.566759] Open file Write Only
        [ 2166.566763] NON Block
        [ 2167.566404] Chr_close Close
      #+END_SRC

** 编写LED，交叉编译

   1. LED.h代码：
      #+BEGIN_HTML
      <script src="https://gist.github.com/creamidea/5410956.js"></script>
      #+END_HTML
   2. LED.c代码：
      #+BEGIN_HTML
      <script src="https://gist.github.com/creamidea/5410963.js"></script>
      #+END_HTML
   3. Makefile：
      #+BEGIN_HTML
      <script src="https://gist.github.com/creamidea/5410972.js"></script>
      #+END_HTML
   
** 总结到目前为止编写此类代码步骤：
   1. Linux内核模板：
      #+BEGIN_SRC C
        #include <linux/init.h>
        #include <linux/kernel.h>
        #include <linux/module.h>
        #include <linux/moduleparam.h>  /* Param header */
        #include <linux/fs.h>
        #include <linux/types.h>
        #include <linux/cdev.h>
        #include <linux/slab.h>
        
        #define DRIVER_AUTHOR "icecream <creamidea@gmail.com>"
        #define DRIVER_DESC "A sample driver"
        
        static int __init _init(void) 
        {
          
          return 0;
        }
        
        static void __exit _exit(void)
        {
          
          printk("Exit the driver module!\n");
        }
        
        module_init(_init);     /* enter */
        module_exit(_exit);     /* out */
        
        MODULE_LICENSE("Dual BSD/GPL");
        MODULE_AUTHOR(DRIVER_AUTHOR);
        MODULE_DESCRIPTION(DRIVER_DESC);
        MODULE_ALIAS("Linux Module");
        
      #+END_SRC

   2. 如果有外部变量，则引入： 
      #+BEGIN_SRC C
        /* 引入两个变量 */
        module_param(mymajor, int, 0644);
        module_param(name, charp, 0644);
        
      #+END_SRC
   3. 宏定义设备基础信息：
      #+BEGIN_SRC C
        #define MAJOR_NUM 200           /* 主设备号 */
        #define MINOR_NUM 0             /* 次设备号 */
        #define DEV_NAME "chardev"      /* 设备名称 */
        
      #+END_SRC

   4. 申请主设备号： 
      #+BEGIN_SRC C
        /* mymajor宏定义或者普通定义，用于手动申请设备号 */
        devno = MKDEV(mymajor, 0);
        ret = register_chrdev_region(devno, 1, name);
        if (ret < 0) {
          /* 申请失败让系统帮其申请 */
          alloc_chrdev_region(&devno, 0, 1, name);
          mymajor = MAJOR(devno);
         }
        printk ("Major: %d, Minor: %d\n", mymajor, MINOR(devno));
        
      #+END_SRC

   5. 自己封装一个结构体，便于变量的管理：
      #+BEGIN_SRC C
        /* 自己封装的结构体 */
        typedef struct {
          struct cdev cdev;             /*  */
        } global_dev;
        global_dev* global_devp = NULL; /* 全局的指针 */
        
      #+END_SRC

   6. 在\_\_init函数中申请内存空间：
      #+BEGIN_SRC C
        /* 申请内存空间 */
        /* GFP_KERNEL will block(sleep)（阻塞），直到分配成功 */
        global_devp = (global_dev*)kmalloc(sizeof(global_dev), GFP_KERNEL);
        if (global_devp == NULL) {
          goto err;
        }
              
      #+END_SRC
   7. 在\_\_init函数中编写挂载设备：
      #+BEGIN_SRC C
        /* 把当前添加到内核中正在使用的列表中,通过fops结构体 */
        cdev_init(&devp->cdev, &fops);
        /* 动态配置 */
        devp->cdev.owner = THIS_MODULE;
        devp->cdev.ops = &fops;
        /* 设备，设备号，数量 */
        cdev_add(&devp->cdev, MKDEV(major_num, 0), 1);
        /* 记得delete */
              
      #+END_SRC
   8. 编写file\_operations，这个结构体用于链接User and Kernel 
      #+BEGIN_SRC C
        /* 实现file_operations结构体 */
        /* 上层和内核，中间桥梁作用 */
        static struct file_operations fops = {
          .owner = THIS_MODULE,         /* 指向当前指针模块 */
          .open = chr_open,
          .release = chr_close, /* close函数中只是简单的打印即可，系统会自动释放 */
          .compat_ioctl = chr_ioctl
        };
        
      #+END_SRC
   9. 编写file\_operations中关联的函数（本实例代码）：
      #+BEGIN_SRC C
        /*　读写操作 */
        /* inode描述节点，file描述的是系统中的 */
        static int chr_open(struct inode* inode, struct file* file) 
        {
          /* 先判断权限问题 */
          /* f_mode默认 全1 */
          if (file->f_mode & FMODE_READ) {
            printk ("Open file Read Only\n"); 
          } else if (file->f_mode & FMODE_WRITE) {
            printk ("Open file Write Only\n"); 
          } else {
            printk ("read / write\n");
          }
          /* 打开标志 */
          if (file->f_flags & O_NONBLOCK) {
            printk ("NON Block\n");
          } else {
            printk ("Block\n");
          }
          return 0;
        }
        
        static int chr_close(struct inode* inode, struct file* file)
        {
          printk ("Chr_close Close\n");
          return 0;
        }
        
        /* 控制函数 */
        static long chr_ioctl (struct file * file, 
                               unsigned int cmd, 
                               unsigned long arg) 
        {
          switch(cmd) {
          case 0:
            printk ("arg: %lu\n", arg);
            break;
          case 1:
            printk ("arg: %lu\n",arg);
            break;
          default:
            printk ("No this cmd\n");
            break;
          }
          return 0;
        }
        
      #+END_SRC

   10. 在\_\_exit函数中编写卸载移除设备：
       #+BEGIN_SRC C
         /* 删除设备，空间，释放空间 */
         cdev_del(&global_devp->cdev);
         kfree(global_devp);
        
         /* 注销设备 */
         /* 利用主次编号获取设备编号 */
         unregister_chrdev_region(MKDEV(major_num, 0), 1);
         printk("unregister devno finished!\n");
              
       #+END_SRC

   11. 编写Makefile文件:
       #+BEGIN_SRC makefile
         obj-m:=openclose.o              #这里.c文件名同名
         KERVER=$(shell uname -r)        #获得内核版本
         KERDIR=/usr/src/linux-headers-$(KERVER) #内核路径
         
         CURDIR=$(shell pwd)             #生成位置
         
         all:
                 make -C $(KERDIR) M=$(CURDIR) modules #编译代码
         clean:
                 make -C $(KERDIR) M=$(CURDIR) clean #清除代码
         
       #+END_SRC
* 2013-04-19 金曜日<2013-04-19 Fri>
  今天这堂课上得有些吃力。环境完全搭建不起来。貌似最后排查下来是因为
  我是64位的ubuntu12.04，和那个编译工具不匹配了。后来想安装32位的库文件。
  最后，由于依赖太多了，只能暂时先搁置了。如果以后有机会的继续。

  那么我们开始记录今天上课的笔记吧。

** 代码的准备
   代码的话就是2013-04-19那三个文件(led.h, led.c, Makefile),
   在这里就不再贴出了。
   这里只补充一个测试代码：
   #+BEGIN_SRC c
     #include <stdio.h>
     #include <stdlib.h>
     #include <unistd.h>
     #include <string.h>
     #include <errno.h>
     #include <fcntl.h>
     #include "led.h"
     
     int main(void)
     {
       int fd;
       if((fd=open("/dev/myled", O_RDWR, 0644)) < 0){
         fprintf(stderr, "open error:%s\n",strerror(errno));
         exit(0);
       }
       int i = 0;
       while(1){
         ioctl(fd, LED_OFF, 1);
         ioctl(fd, LED_OFF, 2);
         ioctl(fd, LED_OFF, 3);
         ioctl(fd, LED_OFF, 4);
         sleep(1); i++;
         ioctl(fd, LED_ON, 1);
         ioctl(fd, LED_ON, 2);
         ioctl(fd, LED_ON, 3);
         ioctl(fd, LED_ON, 4);
         sleep(1); i++;
         if(i > 100) break;
       }
       close(fd);
       return 0;
     }
   #+END_SRC
** 烧写环境的配置
