_posts/2013-04-09-Learning-ARM.html

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">创建自己的设备，调用自己写的模块中的函数。</h3>
<div class="outline-text-3" id="text-6-1">


<ol>
<li>模块代码：
      <script src="https://gist.github.com/creamidea/5410271.js"></script>      

</li>
<li>测试代码：



<pre class="example">#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;
#include &lt;string.h&gt;
#include &lt;unistd.h&gt;
#include &lt;fcntl.h&gt;
#include &lt;errno.h&gt;

int main(int argc, char *argv[])
{
  if (argc &lt; 2) {
    /* fprintf(STDOUT, "%s: %d",); */
    printf("Less 2");
    exit(0);
  }

  int fd;
  if ((fd = open(argv[1], O_RDONLY|O_NONBLOCK)) &lt; 0) {
    printf ("Open error\n");
    exit(0);
  }
  sleep(1);
  close(fd);

  if ((fd = open(argv[1], O_WRONLY|O_NONBLOCK)) &lt; 0) {
    printf ("Open error\n");
    exit(0);
  }
  sleep(1);
  close(fd);

  return 0;
}
</pre>


</li>
<li>运行和测试结果：



<pre class="example">$ make
$ sudo insmod ./openclose.ko
$ sudo mknod /dev/chardev c 200 0
$ sudo chmod 777 /dev/chardev 

$ gcc test.c -Wall 
$ ./a.out /dev/chardev 
$ dmesg | tail -6
[ 2165.567054] Open file Read Only
[ 2165.567063] NON Block
[ 2166.566718] Chr_close Close
[ 2166.566759] Open file Write Only
[ 2166.566763] NON Block
[ 2167.566404] Chr_close Close
</pre>

</li>
</ol>


</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2">编写LED，交叉编译</h3>
<div class="outline-text-3" id="text-6-2">


<ol>
<li>LED.h代码：
      <script src="https://gist.github.com/creamidea/5410956.js"></script>
</li>
<li>LED.c代码：
      <script src="https://gist.github.com/creamidea/5410963.js"></script>
</li>
<li>Makefile：
      <script src="https://gist.github.com/creamidea/5410972.js"></script>
</li>
</ol>


</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3">总结到目前为止编写此类代码步骤：</h3>
<div class="outline-text-3" id="text-6-3">

<ol>
<li>Linux内核模板：



<pre class="example">#include &lt;linux/init.h&gt;
#include &lt;linux/kernel.h&gt;
#include &lt;linux/module.h&gt;
#include &lt;linux/moduleparam.h&gt;  /* Param header */
#include &lt;linux/fs.h&gt;
#include &lt;linux/types.h&gt;
#include &lt;linux/cdev.h&gt;
#include &lt;linux/slab.h&gt;

#define DRIVER_AUTHOR "icecream &lt;creamidea@gmail.com&gt;"
#define DRIVER_DESC "A sample driver"

static int __init _init(void) 
{

  return 0;
}

static void __exit _exit(void)
{

  printk("Exit the driver module!\n");
}

module_init(_init);     /* enter */
module_exit(_exit);     /* out */

MODULE_LICENSE("Dual BSD/GPL");
MODULE_AUTHOR(DRIVER_AUTHOR);
MODULE_DESCRIPTION(DRIVER_DESC);
MODULE_ALIAS("Linux Module");

</pre>


</li>
<li>如果有外部变量，则引入： 



<pre class="example">/* 引入两个变量 */
module_param(mymajor, int, 0644);
module_param(name, charp, 0644);

</pre>

</li>
<li>宏定义设备基础信息：



<pre class="example">#define MAJOR_NUM 200           /* 主设备号 */
#define MINOR_NUM 0             /* 次设备号 */
#define DEV_NAME "chardev"      /* 设备名称 */

</pre>


</li>
<li>申请主设备号： 



<pre class="example">/* mymajor宏定义或者普通定义，用于手动申请设备号 */
devno = MKDEV(mymajor, 0);
ret = register_chrdev_region(devno, 1, name);
if (ret &lt; 0) {
  /* 申请失败让系统帮其申请 */
  alloc_chrdev_region(&amp;devno, 0, 1, name);
  mymajor = MAJOR(devno);
 }
printk ("Major: %d, Minor: %d\n", mymajor, MINOR(devno));

</pre>


</li>
<li>自己封装一个结构体，便于变量的管理：



<pre class="example">/* 自己封装的结构体 */
typedef struct {
  struct cdev cdev;             /*  */
} global_dev;
global_dev* global_devp = NULL; /* 全局的指针 */

</pre>


</li>
<li>在__init函数中申请内存空间：



<pre class="example">/* 申请内存空间 */
/* GFP_KERNEL will block(sleep)（阻塞），直到分配成功 */
global_devp = (global_dev*)kmalloc(sizeof(global_dev), GFP_KERNEL);
if (global_devp == NULL) {
  goto err;
}

</pre>

</li>
<li>在__init函数中编写挂载设备：



<pre class="example">/* 把当前添加到内核中正在使用的列表中,通过fops结构体 */
cdev_init(&amp;devp-&gt;cdev, &amp;fops);
/* 动态配置 */
devp-&gt;cdev.owner = THIS_MODULE;
devp-&gt;cdev.ops = &amp;fops;
/* 设备，设备号，数量 */
cdev_add(&amp;devp-&gt;cdev, MKDEV(major_num, 0), 1);
/* 记得delete */

</pre>

</li>
<li>编写file_operations，这个结构体用于链接User and Kernel 



<pre class="example">/* 实现file_operations结构体 */
/* 上层和内核，中间桥梁作用 */
static struct file_operations fops = {
  .owner = THIS_MODULE,         /* 指向当前指针模块 */
  .open = chr_open,
  .release = chr_close, /* close函数中只是简单的打印即可，系统会自动释放 */
  .compat_ioctl = chr_ioctl
};

</pre>

</li>
<li>编写file_operations中关联的函数（本实例代码）：



<pre class="example">/*　读写操作 */
/* inode描述节点，file描述的是系统中的 */
static int chr_open(struct inode* inode, struct file* file) 
{
  /* 先判断权限问题 */
  /* f_mode默认 全1 */
  if (file-&gt;f_mode &amp; FMODE_READ) {
    printk ("Open file Read Only\n"); 
  } else if (file-&gt;f_mode &amp; FMODE_WRITE) {
    printk ("Open file Write Only\n"); 
  } else {
    printk ("read / write\n");
  }
  /* 打开标志 */
  if (file-&gt;f_flags &amp; O_NONBLOCK) {
    printk ("NON Block\n");
  } else {
    printk ("Block\n");
  }
  return 0;
}

static int chr_close(struct inode* inode, struct file* file)
{
  printk ("Chr_close Close\n");
  return 0;
}

/* 控制函数 */
static long chr_ioctl (struct file * file, 
                       unsigned int cmd, 
                       unsigned long arg) 
{
  switch(cmd) {
  case 0:
    printk ("arg: %lu\n", arg);
    break;
  case 1:
    printk ("arg: %lu\n",arg);
    break;
  default:
    printk ("No this cmd\n");
    break;
  }
  return 0;
}

</pre>


</li>
<li>在__exit函数中编写卸载移除设备：



<pre class="example">/* 删除设备，空间，释放空间 */
cdev_del(&amp;global_devp-&gt;cdev);
kfree(global_devp);

/* 注销设备 */
/* 利用主次编号获取设备编号 */
unregister_chrdev_region(MKDEV(major_num, 0), 1);
printk("unregister devno finished!\n");

</pre>


</li>
<li>编写Makefile文件:



<pre class="example">obj-m:=openclose.o              #这里.c文件名同名
KERVER=$(shell uname -r)        #获得内核版本
KERDIR=/usr/src/linux-headers-$(KERVER) #内核路径

CURDIR=$(shell pwd)             #生成位置

all:
        make -C $(KERDIR) M=$(CURDIR) modules #编译代码
clean:
        make -C $(KERDIR) M=$(CURDIR) clean #清除代码

</pre>

</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">2013-04-19 金曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-19 Fri</span></span></h2>
<div class="outline-text-2" id="text-7">

<p>  今天这堂课上得有些吃力。环境完全搭建不起来。貌似最后排查下来是因为
  我是64位的ubuntu12.04，和那个编译工具不匹配了。后来想安装32位的库文件。
  最后，由于依赖太多了，只能暂时先搁置了。如果以后有机会的继续。
</p>
<p>
  那么我们开始记录今天上课的笔记吧。
</p>

</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1">代码的准备</h3>
<div class="outline-text-3" id="text-7-1">

<p>   代码的话就是2013-04-19那三个文件(led.h, led.c, Makefile),
   在这里就不再贴出了。
   这里只补充一个测试代码：
</p>


<pre class="example">#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;
#include &lt;unistd.h&gt;
#include &lt;string.h&gt;
#include &lt;errno.h&gt;
#include &lt;fcntl.h&gt;
#include "led.h"

int main(void)
{
  int fd;
  if((fd=open("/dev/myled", O_RDWR, 0644)) &lt; 0){
    fprintf(stderr, "open error:%s\n",strerror(errno));
    exit(0);
  }
  int i = 0;
  while(1){
    ioctl(fd, LED_OFF, 1);
    ioctl(fd, LED_OFF, 2);
    ioctl(fd, LED_OFF, 3);
    ioctl(fd, LED_OFF, 4);
    sleep(1); i++;
    ioctl(fd, LED_ON, 1);
    ioctl(fd, LED_ON, 2);
    ioctl(fd, LED_ON, 3);
    ioctl(fd, LED_ON, 4);
    sleep(1); i++;
    if(i &gt; 100) break;
  }
  close(fd);
  return 0;
}
</pre>

</div>

</div>
