_articles/2013-04-09-Learning-ARM.org
*** 交叉编译环境的搭建
    - 下载：[[http://filesresidence.com/File/c890jgedo09pg][EABI\_4.3.3\_EmbedSky\_20090812.tar.bz2]] 
    - 解压： =$ sudo tar -jxvf EABI_4.3.3_EmbedSky_20090812.tar.bz2 -C /=
    - 修改系统路径：
      #+BEGIN_SRC sh
        $ sudo vim /etc/bash.bashrc
        在文件最后加入：
        export PATH=$PATH:/opt/EmbedSky/4.3.3/bin
        
        $ vim ~/.bashrc
        在文件最后加入：
        export PATH=$PATH:/opt/EmbedSky/4.3.3/bin
        
        生效环境变量
        $. ~/.bashrc
        
        测试
        $ arm-linux-gcc-v
      #+END_SRC
    
    我省略了一些不必要的步骤，详细的可以看这个：

    http://blog.csdn.net/ymsunshine/article/details/8037315

    
** 编译：
   #+BEGIN_SRC sh
     $ arm-linux-gcc ./test.c -o arm_test
     $ make
   #+END_SRC

** 程序下载
*** 下载
    去SecureCRT官网http://www.vandyke.com/products/securecrt/
    下载符合你版本的。

    使用的话，装上驱动，连上ARM，然后将SecureCRT调至COM3（视情况而定）
    选择7下载（貌似，记不清了。）

*** ARM系统中设置
    使用上述工具SecureCRT连接ARM，之后如下：(具体的不知道了，只能下次做实验
    时候的继续补充了。)
    #+BEGIN_SRC sh
      挂载U盘
      /usb/
      # mount /dev/sda1 /usb
      cp /usb/tst/ar
      insmod led.ko
      mknod /dev/myled c 252 0
      ./arm_test /dev/myled
       led open
       open successfully!
    #+END_SRC
