_posts/2013-04-09-Learning-ARM.html

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2">烧写环境的配置</h3>
<div class="outline-text-3" id="text-7-2">


</div>

<div id="outline-container-7-2-1" class="outline-4">
<h4 id="sec-7-2-1">交叉编译环境的搭建</h4>
<div class="outline-text-4" id="text-7-2-1">

<ul>
<li>下载：<a href="http://filesresidence.com/File/c890jgedo09pg">EABI_4.3.3_EmbedSky_20090812.tar.bz2</a> 
</li>
<li>解压： <code>$ sudo tar -jxvf EABI_4.3.3_EmbedSky_20090812.tar.bz2 -C /</code>
</li>
<li>修改系统路径：



<pre class="example">$ sudo vim /etc/bash.bashrc
在文件最后加入：
export PATH=$PATH:/opt/EmbedSky/4.3.3/bin

$ vim ~/.bashrc
在文件最后加入：
export PATH=$PATH:/opt/EmbedSky/4.3.3/bin

生效环境变量
$. ~/.bashrc

测试
$ arm-linux-gcc-v
</pre>

</li>
</ul>


<p>    
    我省略了一些不必要的步骤，详细的可以看这个：
</p>
<p>
    <a href="http://blog.csdn.net/ymsunshine/article/details/8037315">http://blog.csdn.net/ymsunshine/article/details/8037315</a>
</p>

</div>
</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3">编译：</h3>
<div class="outline-text-3" id="text-7-3">




<pre class="example">$ arm-linux-gcc ./test.c -o arm_test
$ make
</pre>


</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4">程序下载</h3>
<div class="outline-text-3" id="text-7-4">


</div>

<div id="outline-container-7-4-1" class="outline-4">
<h4 id="sec-7-4-1">下载</h4>
<div class="outline-text-4" id="text-7-4-1">

<p>    去SecureCRT官网<a href="http://www.vandyke.com/products/securecrt/">http://www.vandyke.com/products/securecrt/</a>
    下载符合你版本的。
</p>
<p>
    使用的话，装上驱动，连上ARM，然后将SecureCRT调至COM3（视情况而定）
    选择7下载（貌似，记不清了。）
</p>
</div>

</div>

<div id="outline-container-7-4-2" class="outline-4">
<h4 id="sec-7-4-2">ARM系统中设置</h4>
<div class="outline-text-4" id="text-7-4-2">

<p>    使用上述工具SecureCRT连接ARM，之后如下：(具体的不知道了，只能下次做实验
    时候的继续补充了。)
</p>


<pre class="example">挂载U盘
/usb/
# mount /dev/sda1 /usb
cp /usb/tst/ar
insmod led.ko
mknod /dev/myled c 252 0
./arm_test /dev/myled
 led open
 open successfully!
</pre>


</div>
</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">写在最后</h2>
<div class="outline-text-2" id="text-8">

<p>  最后居然草草收场？！实在感到有些许惋惜。
</p></div>
</div>
